Revit 2024 API
BuiltInFailures.SketchFailures.ShortCurveInSketchRoof Property
 The sketch contains an extremely short line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ShortCurveInSketchRoof { get; }
Visual Basic
Public Shared ReadOnly Property ShortCurveInSketchRoof As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ShortCurveInSketchRoof {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace